Revit 2026 API

# ReleaseType Enumeration

---

The release type.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum ReleaseType
```
```vb
Public Enumeration ReleaseType
```
```cpp
public enum class ReleaseType
```
```fsharp
type ReleaseType
```

| Member name | Value | Description |
| --- | --- | --- |
| BendingMoment | 2 | Bending Moment. |
| Fixed | 0 | Fixed. |
| Pinned | 1 | Pinned. |
| UserDefined | 3 | User Defined. |

#### Reference

Autodesk.Revit.DB.Structure Namespace